print('!Это не робочая пайтон папка!')

# 1) Пользователь вводит количество денег (int), у тебя есть перечень продуктов (переменные) со значениями (цена) apple = 20 (int), banana = 23.
# -----
# Домашние Задание 18/06/2021 - 21/06/2021:
# 1) Доделать задание(пароль)
# -----

# Домашние Задание 21/06/2021 - 23/06/2021:
# 1) Доделать задание (8)
# -----

# Домашние Задание 23/06/2021 - 28/06/2021:
# 1) Сам сделать задание с поролям(Задание 4)
# -----

# Домашние Задание 28/06/2021 - 30/06/2021:
# 1) Сделать задание 1 на (for-construction.py) в папке (task4)
# -----

# Домашние Задание 30/06/2021 - 02/07/2021:
# 1) Сделать задачу 2 на (for-construction.py)
# -----

# Домашние Задание 02/07/2021 - 05/07/2021:
# 1) Сделать задачу 4 на (for-construction.py)
# ---------

# Тебе надо пойти в магазин и принисти отчёт сколько всего надо было купить и сколько ты купиль и сколько не купиль и какие именно товары ты не купиль.

# Домашние Задание 12/07/2021 - 16/07/2021
# 1) Используя цикл while, выведите на экран для числа 2 его степени от 0 до 20. Возведение в степень в Python обозначается как **. Фрагмент вывода:
#
#   32
#   64
#  128
#  256
#  512
# 1024
# идт
# ----------


