
# Есть школа, в которой хотят обновить несколько классов (завезти новые парты). У нас есть три класса
# Класс А, класс Б, класс В - в каждом классе есть ученики (пользователь вводит три числа, для каждого класса соответственно).
# За каждой партой может сидеть два человека. Одна парта - это два человека. Вопрос - сколько нужно закупить парт, чтобы расадить
# всех учеников.

school1 = int(input("Веди сколько в классе А учеников: "))
school2 = int(input("Веди сколько в классе Б учеников: "))
school3 = int(input("Веди сколько в классе В учеников: "))
#
quest = school1 + school2 + school3
quest3 = 2
quest2 = quest // quest3
print(quest2, "Нужно парт для столько учеников!")

# Домашние Задане 7/6/2021 - 14/6/2021

# Решить задачу правилно!
# -Я не решил...
# -----



